telink-semi/unisdk/soc/TLSR922X/registers/tlk_codec_0581_reg.h
#define REG_ADC_CTRL2_ADDR 0x0000C021
#define BF_ADC0_IBIAS_INFO 0x0000C021, 0x00000300
#define BF_ADC1_IBIAS_INFO 0x0000C021, 0x00000304

#define REG_ADC_CTRL3_ADDR 0x0000C022
#define BF_ADC2_IBIAS_INFO 0x0000C022, 0x00000300

#define REG_ADC_CTRL4_ADDR  0x0000C023
#define BF_ADC0_HPF_EN_INFO 0x0000C023, 0x00000200
#define BF_ADC1_HPF_EN_INFO 0x0000C023, 0x00000202
#define BF_ADC2_HPF_EN_INFO 0x0000C023, 0x00000204

#define REG_ADC_CTRL5_ADDR   0x0000C024
#define BF_ADC01_FCOMP_INFO  0x0000C024, 0x00000100
#define BF_ADC2_FCOMP_INFO   0x0000C024, 0x00000101
#define BF_ADC_HARD_VOL_INFO 0x0000C024, 0x00000104
#define BF_ADC_VOL_LINK_INFO 0x0000C024, 0x00000105
#define BF_ADC_VOL_ZC_INFO   0x0000C024, 0x00000106

#define REG_ADC_CTRL6_ADDR        0x0000C025
#define BF_ADC_AIN_CHRG_TIME_INFO 0x0000C025, 0x00000400
#define BF_ADC_CHOP_EN_INFO       0x0000C025, 0x00000105

#define REG_ADC_CTRL7_ADDR      0x0000C026
#define BF_ADC_VOC_WKUP_INFO    0x0000C026, 0x00000100
#define BF_AIN0_INPUT_MODE_INFO 0x0000C026, 0x00000104
#define BF_AIN1_INPUT_MODE_INFO 0x0000C026, 0x00000105

#define REG_ADC_MUTES_ADDR 0x0000C027
#define BF_ADC0_MUTE_INFO  0x0000C027, 0x00000100
#define BF_ADC1_MUTE_INFO  0x0000C027, 0x00000101
#define BF_ADC2_MUTE_INFO  0x0000C027, 0x00000102

#define REG_ADC0_VOL_ADDR 0x0000C028
#define BF_ADC0_VOL_INFO  0x0000C028, 0x00000800

#define REG_ADC1_VOL_ADDR 0x0000C029
#define BF_ADC1_VOL_INFO  0x0000C029, 0x00000800

#define REG_ADC2_VOL_ADDR 0x0000C02A
#define BF_ADC2_VOL_INFO  0x0000C02A, 0x00000800

#define REG_ADC_DITHER_LEV_ADDR 0x0000C02B
#define BF_ADC_DITHER_LEV_INFO  0x0000C02B, 0x00000300

#define REG_PGA0_CTRL1_ADDR   0x0000C030
#define BF_PGA0_GAIN_INFO     0x0000C030, 0x00000B00
#define BF_PGA0_SLEW_DIS_INFO 0x0000C030, 0x00000107

#define REG_PGA0_CTRL2_ADDR 0x0000C031

#define REG_PGA1_CTRL1_ADDR   0x0000C032
#define BF_PGA1_GAIN_INFO     0x0000C032, 0x00000B00
#define BF_PGA1_SLEW_DIS_INFO 0x0000C032, 0x00000107

#define REG_PGA1_CTRL2_ADDR 0x0000C033

#define REG_PGA2_CTRL1_ADDR   0x0000C034
#define BF_PGA2_GAIN_INFO     0x0000C034, 0x00000B00
#define BF_PGA2_SLEW_DIS_INFO 0x0000C034, 0x00000107

#define REG_PGA2_CTRL2_ADDR 0x0000C035

#define REG_PGA_CTRL1_ADDR    0x0000C036
#define BF_PGA_SLEW_RATE_INFO 0x0000C036, 0x00000200
#define BF_PGA_GAIN_LINK_INFO 0x0000C036, 0x00000104

#define REG_PGA_CTRL2_ADDR      0x0000C039
#define BF_PGA0_RIN_INFO        0x0000C039, 0x00000100
#define BF_PGA1_RIN_INFO        0x0000C039, 0x00000101
#define BF_PGA2_RIN_INFO        0x0000C039, 0x00000102
#define BF_PGA0_POWER_MODE_INFO 0x0000C039, 0x00000104
#define BF_PGA1_POWER_MODE_INFO 0x0000C039, 0x00000105
#define BF_PGA2_POWER_MODE_INFO 0x0000C039, 0x00000106

#define REG_MBIAS_CTRL_ADDR  0x0000C030
#define BF_MBIAS0_LEVEL_INFO 0x0000C030, 0x00000100
#define BF_MBIAS1_LEVEL_INFO 0x0000C030, 0x00000101
#define BF_MBIAS_IBIAS_INFO  0x0000C030, 0x00000204

#define REG_DMIC_CTRL1_ADDR    0x0000C040
#define BF_DMIC_CLK0_RATE_INFO 0x0000C040, 0x00000300
#define BF_DMIC_CLK1_RATE_INFO 0x0000C040, 0x00000304

#define REG_DMIC_CTRL2_ADDR      0x0000C041
#define BF_DMIC01_FS_INFO        0x0000C041, 0x00000300
#define BF_DMIC01_HPF_EN_INFO    0x0000C041, 0x00000103
#define BF_DMIC01_DEC_ORDER_INFO 0x0000C041, 0x00000104
#define BF_DMIC01_FCOMP_INFO     0x0000C041, 0x00000105
#define BF_DMIC01_EDGE_INFO      0x0000C041, 0x00000106
#define BF_DMIC01_MAP_INFO       0x0000C041, 0x00000107

#define REG_DMIC_CTRL3_ADDR      0x0000C042
#define BF_DMIC23_FS_INFO        0x0000C042, 0x00000300
#define BF_DMIC23_HPF_EN_INFO    0x0000C042, 0x00000103
#define BF_DMIC23_DEC_ORDER_INFO 0x0000C042, 0x00000104
#define BF_DMIC23_FCOMP_INFO     0x0000C042, 0x00000105
#define BF_DMIC23_EDGE_INFO      0x0000C042, 0x00000106
#define BF_DMIC23_MAP_INFO       0x0000C042, 0x00000107

#define REG_DMIC_CTRL4_ADDR      0x0000C043
#define BF_DMIC45_FS_INFO        0x0000C043, 0x00000300
#define BF_DMIC45_HPF_EN_INFO    0x0000C043, 0x00000103
#define BF_DMIC45_DEC_ORDER_INFO 0x0000C043, 0x00000104
#define BF_DMIC45_FCOMP_INFO     0x0000C043, 0x00000105
#define BF_DMIC45_EDGE_INFO      0x0000C043, 0x00000106
#define BF_DMIC45_MAP_INFO       0x0000C043, 0x00000107

#define REG_DMIC_CTRL5_ADDR      0x0000C044
#define BF_DMIC67_FS_INFO        0x0000C044, 0x00000300
#define BF_DMIC67_HPF_EN_INFO    0x0000C044, 0x00000103
#define BF_DMIC67_DEC_ORDER_INFO 0x0000C044, 0x00000104
#define BF_DMIC67_FCOMP_INFO     0x0000C044, 0x00000105
#define BF_DMIC67_EDGE_INFO      0x0000C044, 0x00000106
#define BF_DMIC67_MAP_INFO       0x0000C044, 0x00000107

#define REG_DMIC_CTRL6_ADDR   0x0000C045
#define BF_DMIC_HARD_VOL_INFO 0x0000C045, 0x00000100
#define BF_DMIC_VOL_LINK_INFO 0x0000C045, 0x00000101
#define BF_DMIC_VOL_ZC_INFO   0x0000C045, 0x00000102

#define REG_DMIC_MUTES_ADDR 0x0000C046
#define BF_DMIC0_MUTE_INFO  0x0000C046, 0x00000100
#define BF_DMIC1_MUTE_INFO  0x0000C046, 0x00000101
#define BF_DMIC2_MUTE_INFO  0x0000C046, 0x00000102
#define BF_DMIC3_MUTE_INFO  0x0000C046, 0x00000103
#define BF_DMIC4_MUTE_INFO  0x0000C046, 0x00000104
#define BF_DMIC5_MUTE_INFO  0x0000C046, 0x00000105
#define BF_DMIC6_MUTE_INFO  0x0000C046, 0x00000106
#define BF_DMIC7_MUTE_INFO  0x0000C046, 0x00000107

#define REG_DMIC_VOL0_ADDR 0x0000C047
#define BF_DMIC0_VOL_INFO  0x0000C047, 0x00000800

#define REG_DMIC_VOL1_ADDR 0x0000C048
#define BF_DMIC1_VOL_INFO  0x0000C048, 0x00000800

#define REG_DMIC_VOL2_ADDR 0x0000C049
#define BF_DMIC2_VOL_INFO  0x0000C049, 0x00000800

#define REG_DMIC_VOL3_ADDR 0x0000C04A
#define BF_DMIC3_VOL_INFO  0x0000C04A, 0x00000800

#define REG_DMIC_VOL4_ADDR 0x0000C04B
#define BF_DMIC4_VOL_INFO  0x0000C04B, 0x00000800

#define REG_DMIC_VOL5_ADDR 0x0000C04C
#define BF_DMIC5_VOL_INFO  0x0000C04C, 0x00000800

#define REG_DMIC_VOL6_ADDR 0x0000C04D
#define BF_DMIC6_VOL_INFO  0x0000C04D, 0x00000800

#define REG_DMIC_VOL7_ADDR 0x0000C04E
#define BF_DMIC7_VOL_INFO  0x0000C04E, 0x00000800

#define REG_EQ_CFG_ADDR     0x0000C040
#define BF_EQ_RUN_INFO      0x0000C040, 0x00000100
#define BF_EQ_CLEAR_INFO    0x0000C040, 0x00000101
#define BF_EQ_BANK_SEL_INFO 0x0000C040, 0x00000102

#define REG_EQ_ROUTE_ADDR 0x0000C044
#define BF_EQ_ROUTE_INFO  0x0000C044, 0x00000700

#define REG_DAC_CTRL1_ADDR    0x0000C050
#define BF_DAC_FS_INFO        0x0000C050, 0x00000300
#define BF_DAC_FCOMP_INFO     0x0000C050, 0x00000103
#define BF_DAC_LPM_INFO       0x0000C050, 0x00000106
#define BF_DAC_MORE_FILT_INFO 0x0000C050, 0x00000107

#define REG_DAC_CTRL2_ADDR      0x0000C051
#define BF_DAC_HARD_VOL_INFO    0x0000C051, 0x00000101
#define BF_DAC_VOL_ZC_INFO      0x0000C051, 0x00000102
#define BF_DAC_LPM_II_INFO      0x0000C051, 0x00000103
#define BF_DAC0_HPF_EN_INFO     0x0000C051, 0x00000104
#define BF_DAC0_MUTE_INFO       0x0000C051, 0x00000106
#define BF_DAC0_FORCE_MUTE_INFO 0x0000C051, 0x00000107

