telink-semi/unisdk/soc/TLSR922X/registers/tlk_codec_0581_reg.h
#define REG_DAC_VOL0_ADDR 0x0000C052
#define BF_DAC0_VOL_INFO  0x0000C052, 0x00000800

#define REG_DAC_VOL1_ADDR 0x0000C053

#define REG_DAC_ROUTE0_ADDR 0x0000C054
#define BF_DAC0_ROUTE_INFO  0x0000C054, 0x00000700

#define REG_HP_CTRL_ADDR 0x0000C060
#define BF_HP0_MODE_INFO 0x0000C060, 0x00000100

#define REG_HP_LVMODE_CTRL1_ADDR 0x0000C061
#define BF_HP_LVMODE_EN_INFO     0x0000C061, 0x00000100
#define BF_HP_LVMODE_CM_EN_INFO  0x0000C061, 0x00000101

#define REG_HP_LVMODE_CTRL2_ADDR      0x0000C062
#define BF_HP_LVMODE_AUTOSW_MODE_INFO 0x0000C062, 0x00000100
#define BF_HP_LVMODE_AUTO_DLY_INFO    0x0000C062, 0x00000301
#define BF_HP_LVMODE_CM_DLY_INFO      0x0000C062, 0x00000204

#define REG_HP_LVMODE_CTRL3_ADDR 0x0000C063
#define BF_HP_LVMODE_SWITCH_INFO 0x0000C063, 0x00000100

#define REG_HPLDO_CTRL_ADDR    0x0000C066
#define BF_HPLDO_EN_INFO       0x0000C066, 0x00000100
#define BF_HPLDO_BYPASS_INFO   0x0000C066, 0x00000101
#define BF_HPLDO_VOUT_SET_INFO 0x0000C066, 0x00000202

#define REG_PB_CTRL_ADDR      0x0000C06F
#define BF_PB_POWER_CTRL_INFO 0x0000C06F, 0x00000200

#define REG_FDEC_CTRL1_ADDR   0x0000C070
#define BF_FDEC01_IN_FS_INFO  0x0000C070, 0x00000300
#define BF_FDEC01_OUT_FS_INFO 0x0000C070, 0x00000404

#define REG_FDEC_CTRL2_ADDR   0x0000C071
#define BF_FDEC23_IN_FS_INFO  0x0000C071, 0x00000300
#define BF_FDEC23_OUT_FS_INFO 0x0000C071, 0x00000404

#define REG_FDEC_ROUTE0_ADDR 0x0000C074
#define BF_FDEC0_ROUTE_INFO  0x0000C074, 0x00000600

#define REG_FDEC_ROUTE1_ADDR 0x0000C075
#define BF_FDEC1_ROUTE_INFO  0x0000C075, 0x00000600

#define REG_FDEC_ROUTE2_ADDR 0x0000C076
#define BF_FDEC2_ROUTE_INFO  0x0000C076, 0x00000600

#define REG_FDEC_ROUTE3_ADDR 0x0000C077
#define BF_FDEC3_ROUTE_INFO  0x0000C077, 0x00000600

#define REG_FINT_CTRL1_ADDR   0x0000C080
#define BF_FINT01_IN_FS_INFO  0x0000C080, 0x00000400
#define BF_FINT01_OUT_FS_INFO 0x0000C080, 0x00000304

#define REG_FINT_ROUTE0_ADDR 0x0000C084
#define BF_FINT0_ROUTE_INFO  0x0000C084, 0x00000700

#define REG_FINT_ROUTE1_ADDR 0x0000C085
#define BF_FINT1_ROUTE_INFO  0x0000C085, 0x00000700

#define REG_ASRCI_CTRL_ADDR       0x0000C090
#define BF_ASRCI_OUT_FS_INFO      0x0000C090, 0x00000300
#define BF_ASRCI_LPM_II_INFO      0x0000C090, 0x00000103
#define BF_ASRCI_OSCCAL_LOCK_INFO 0x0000C090, 0x00000104
#define BF_ASRCI_LPM_INFO         0x0000C090, 0x00000105
#define BF_ASRCI_VFILT_INFO       0x0000C090, 0x00000106
#define BF_ASRCI_MORE_FILT_INFO   0x0000C090, 0x00000107

#define REG_ASRCI_ROUTE01_ADDR 0x0000C091
#define BF_ASRCI0_ROUTE_INFO   0x0000C091, 0x00000400

#define REG_ASRCO_CTRL_ADDR       0x0000C093
#define BF_ASRCO_IN_FS_INFO       0x0000C093, 0x00000300
#define BF_ASRCO_LPM_II_INFO      0x0000C093, 0x00000103
#define BF_ASRCO_OSCCAL_LOCK_INFO 0x0000C093, 0x00000104
#define BF_ASRCO_LPM_INFO         0x0000C093, 0x00000105
#define BF_ASRCO_VFILT_INFO       0x0000C093, 0x00000106
#define BF_ASRCO_MORE_FILT_INFO   0x0000C093, 0x00000107

#define REG_ASRCO_ROUTE0_ADDR 0x0000C094
#define BF_ASRCO0_ROUTE_INFO  0x0000C094, 0x00000600

#define REG_ASRCO_ROUTE1_ADDR 0x0000C095
#define BF_ASRCO1_ROUTE_INFO  0x0000C095, 0x00000600

#define REG_ASRCO_ROUTE2_ADDR 0x0000C096
#define BF_ASRCO2_ROUTE_INFO  0x0000C096, 0x00000600

#define REG_FDSP_RUN_ADDR 0x0000C0A0
#define BF_FDSP_RUN_INFO  0x0000C0A0, 0x00000100

#define REG_FDSP_CTRL1_ADDR     0x0000C0A1
#define BF_FDSP_BANK_SEL_INFO   0x0000C0A1, 0x00000200
#define BF_FDSP_RAMP_MODE_INFO  0x0000C0A1, 0x00000102
#define BF_FDSP_ZERO_STATE_INFO 0x0000C0A1, 0x00000103
#define BF_FDSP_RAMP_RATE_INFO  0x0000C0A1, 0x00000404

#define REG_FDSP_CTRL2_ADDR 0x0000C0A2
#define BF_FDSP_LAMBDA_INFO 0x0000C0A2, 0x00000600

#define REG_FDSP_CTRL3_ADDR          0x0000C0A3
#define BF_FDSP_COPY_AB_INFO         0x0000C0A3, 0x00000100
#define BF_FDSP_COPY_AC_INFO         0x0000C0A3, 0x00000101
#define BF_FDSP_COPY_BA_INFO         0x0000C0A3, 0x00000102
#define BF_FDSP_COPY_BC_INFO         0x0000C0A3, 0x00000103
#define BF_FDSP_COPY_CA_INFO         0x0000C0A3, 0x00000104
#define BF_FDSP_COPY_CB_INFO         0x0000C0A3, 0x00000105
#define BF_FDSP_COPY_DONE_CLEAR_INFO 0x0000C0A3, 0x00000107

#define REG_FDSP_CTRL4_ADDR        0x0000C0A4
#define BF_FDSP_RATE_SOURCE_INFO   0x0000C0A4, 0x00000400
#define BF_FDSP_EXP_ATK_SPEED_INFO 0x0000C0A4, 0x00000104
#define BF_FDSP_ONZ_SOURCE_INFO    0x0000C0A4, 0x00000105

#define REG_FDSP_CTRL5_ADDR   0x0000C0A5
#define BF_FDSP_RATE_DIV_INFO 0x0000C0A5, 0x00001000

#define REG_FDSP_CTRL6_ADDR 0x0000C0A6

#define REG_FDSP_CTRL7_ADDR 0x0000C0A7
#define BF_FDSP_MOD_N_INFO  0x0000C0A7, 0x00000600

#define REG_FDSP_CTRL8_ADDR    0x0000C0A8
#define BF_FDSP_REG_COND0_INFO 0x0000C0A8, 0x00000100
#define BF_FDSP_REG_COND1_INFO 0x0000C0A8, 0x00000101
#define BF_FDSP_REG_COND2_INFO 0x0000C0A8, 0x00000102
#define BF_FDSP_REG_COND3_INFO 0x0000C0A8, 0x00000103
#define BF_FDSP_REG_COND4_INFO 0x0000C0A8, 0x00000104
#define BF_FDSP_REG_COND5_INFO 0x0000C0A8, 0x00000105
#define BF_FDSP_REG_COND6_INFO 0x0000C0A8, 0x00000106
#define BF_FDSP_REG_COND7_INFO 0x0000C0A8, 0x00000107

#define REG_FDSP_SL_ADDR_ADDR 0x0000C0A9
#define BF_FDSP_SL_ADDR_INFO  0x0000C0A9, 0x00000600

#define REG_FDSP_SL_P0_0_ADDR 0x0000C0AA
#define BF_FDSP_SL_P0_INFO    0x0000C0AA, 0x00002000

#define REG_FDSP_SL_P0_1_ADDR 0x0000C0AB

#define REG_FDSP_SL_P0_2_ADDR 0x0000C0AC

#define REG_FDSP_SL_P0_3_ADDR 0x0000C0AD

#define REG_FDSP_SL_P1_0_ADDR 0x0000C0AE
#define BF_FDSP_SL_P1_INFO    0x0000C0AE, 0x00002000

#define REG_FDSP_SL_P1_1_ADDR 0x0000C0AF

#define REG_FDSP_SL_P1_2_ADDR 0x0000C0B0

#define REG_FDSP_SL_P1_3_ADDR 0x0000C0B1

#define REG_FDSP_SL_P2_0_ADDR 0x0000C0B2
#define BF_FDSP_SL_P2_INFO    0x0000C0B2, 0x00002000

#define REG_FDSP_SL_P2_1_ADDR 0x0000C0B3

#define REG_FDSP_SL_P2_2_ADDR 0x0000C0B4

#define REG_FDSP_SL_P2_3_ADDR 0x0000C0B5

#define REG_FDSP_SL_P3_0_ADDR 0x0000C0B6
#define BF_FDSP_SL_P3_INFO    0x0000C0B6, 0x00002000

#define REG_FDSP_SL_P3_1_ADDR 0x0000C0B7

#define REG_FDSP_SL_P3_2_ADDR 0x0000C0B8

