telink-semi/unisdk/soc/TLSR922X/registers/tlk_codec_0581_reg.h
#define REG_FDSP_SL_P3_3_ADDR 0x0000C0B9

#define REG_FDSP_SL_P4_0_ADDR 0x0000C0BA
#define BF_FDSP_SL_P4_INFO    0x0000C0BA, 0x00002000

#define REG_FDSP_SL_P4_1_ADDR 0x0000C0BB

#define REG_FDSP_SL_P4_2_ADDR 0x0000C0BC

#define REG_FDSP_SL_P4_3_ADDR 0x0000C0BD

#define REG_FDSP_SL_UPDATE_ADDR 0x0000C0BE
#define BF_FDSP_SL_UPDATE_INFO  0x0000C0BE, 0x00000100

#define REG_FDSP_ONZ_MASK0_ADDR 0x0000C0BF
#define BF_FDSP_ONZ_MASK_INFO   0x0000C0BF, 0x00001800

#define REG_FDSP_ONZ_MASK1_ADDR 0x0000C0C0

#define REG_FDSP_ONZ_MASK2_ADDR 0x0000C0C1

#define REG_RCOSC_ACTION_ADDR  0x0000C0C2
#define BF_RCOSC_STARTCAL_INFO 0x0000C0C2, 0x00000100
#define BF_RCOSC_FXCAL_INFO    0x0000C0C2, 0x00000101
#define BF_RCOSC_STATUS_INFO   0x0000C0C2, 0x00000204

#define REG_RCOSC_CALCFG0_ADDR 0x0000C0C3
#define BF_RCOSC_REFSEL_INFO   0x0000C0C3, 0x00000400
#define BF_RCOSC_ERR_TH_INFO   0x0000C0C3, 0x00000404

#define REG_RCOSC_CALCFG1_ADDR 0x0000C0C4
#define BF_RCOSC_TASK_TH_INFO  0x0000C0C4, 0x00000400
#define BF_RCOSC_JOB_TH_INFO   0x0000C0C4, 0x00000404

#define REG_RCOSC_FERR0_ADDR 0x0000C0C5
#define BF_RCOSC_FERR_INFO   0x0000C0C5, 0x00000E00

#define REG_RCOSC_FERR1_ADDR 0x0000C0C6

#define REG_RCOSC_FRQTRIM_ADDR 0x0000C0C7
#define BF_RCOSC_FRQTRIM_INFO  0x0000C0C7, 0x00000700

#define REG_RCOSC_FXTRIM_ADDR 0x0000C0C8
#define BF_RCOSC_FXTRIM_INFO  0x0000C0C8, 0x00000700
#define BF_RCOSC_DISTRIM_INFO 0x0000C0C8, 0x00000107

#define REG_RCOSC_TCTRIM_ADDR 0x0000C0C9
#define BF_RCOSC_TCTRIM_INFO  0x0000C0C9, 0x00000700

#define REG_MCLKOUT_IRQ_CTRL_ADDR    0x0000C0D2
#define BF_IRQ_OUT_INFO              0x0000C0D2, 0x00000400
#define BF_CLOCKOUT_AND_IRQ_OUT_INFO 0x0000C0D2, 0x00000404

#define REG_MP_CTRL7_ADDR  0x0000C0D6
#define BF_GPI_DB_INFO     0x0000C0D6, 0x00000300
#define BF_MCLKO_RATE_INFO 0x0000C0D6, 0x00000304

#define REG_MP_CTRL9_ADDR 0x0000C0D8

#define REG_MP_CTRL10_ADDR 0x0000C0D9
#define BF_MP12_MODE_INFO  0x0000C0D9, 0x00000400

#define REG_SELFBOOT_CTRL_ADDR    0x0000C0DA
#define BF_SELFBOOT_DRIVE_INFO    0x0000C0DA, 0x00000200
#define BF_SELFBOOT_PULL_EN_INFO  0x0000C0DA, 0x00000104
#define BF_SELFBOOT_PULL_SEL_INFO 0x0000C0DA, 0x00000105
#define BF_SELFBOOT_SLEW_INFO     0x0000C0DA, 0x00000106

#define REG_SW_EN_CTRL_ADDR   0x0000C0DB
#define BF_SWEN_DRIVE_INFO    0x0000C0DB, 0x00000200
#define BF_SWEN_PULL_EN_INFO  0x0000C0DB, 0x00000104
#define BF_SWEN_PULL_SEL_INFO 0x0000C0DB, 0x00000105
#define BF_SWEN_SLEW_INFO     0x0000C0DB, 0x00000106

#define REG_FSYNC0_CTRL_ADDR    0x0000C0E0
#define BF_FSYNC0_DRIVE_INFO    0x0000C0E0, 0x00000200
#define BF_FSYNC0_SLEW_INFO     0x0000C0E0, 0x00000102
#define BF_FSYNC0_PULL_EN_INFO  0x0000C0E0, 0x00000104
#define BF_FSYNC0_PULL_SEL_INFO 0x0000C0E0, 0x00000105

#define REG_BCLK0_CTRL_ADDR    0x0000C0E1
#define BF_BCLK0_DRIVE_INFO    0x0000C0E1, 0x00000200
#define BF_BCLK0_SLEW_INFO     0x0000C0E1, 0x00000102
#define BF_BCLK0_PULL_EN_INFO  0x0000C0E1, 0x00000104
#define BF_BCLK0_PULL_SEL_INFO 0x0000C0E1, 0x00000105

#define REG_SDATAO0_CTRL_ADDR    0x0000C0E2
#define BF_SDATAO0_DRIVE_INFO    0x0000C0E2, 0x00000200
#define BF_SDATAO0_SLEW_INFO     0x0000C0E2, 0x00000102
#define BF_SDATAO0_PULL_EN_INFO  0x0000C0E2, 0x00000104
#define BF_SDATAO0_PULL_SEL_INFO 0x0000C0E2, 0x00000105

#define REG_SDATAI0_CTRL_ADDR    0x0000C0E3
#define BF_SDATAI0_DRIVE_INFO    0x0000C0E3, 0x00000200
#define BF_SDATAI0_SLEW_INFO     0x0000C0E3, 0x00000102
#define BF_SDATAI0_PULL_EN_INFO  0x0000C0E3, 0x00000104
#define BF_SDATAI0_PULL_SEL_INFO 0x0000C0E3, 0x00000105

#define REG_IRQ_CTRL_ADDR    0x0000C0E4
#define BF_IRQ_DRIVE_INFO    0x0000C0E4, 0x00000200
#define BF_IRQ_SLEW_INFO     0x0000C0E4, 0x00000102
#define BF_IRQ_PULL_EN_INFO  0x0000C0E4, 0x00000104
#define BF_IRQ_PULL_SEL_INFO 0x0000C0E4, 0x00000105

#define REG_MCLKO_CTRL_ADDR    0x0000C0E5
#define BF_MCLKO_DRIVE_INFO    0x0000C0E5, 0x00000200
#define BF_MCLKO_SLEW_INFO     0x0000C0E5, 0x00000102
#define BF_MCLKO_PULL_EN_INFO  0x0000C0E5, 0x00000104
#define BF_MCLKO_PULL_SEL_INFO 0x0000C0E5, 0x00000105

#define REG_I2C_SPI_CTRL_ADDR  0x0000C0EC
#define BF_SDA_MISO_DRIVE_INFO 0x0000C0EC, 0x00000200
#define BF_SDA_MISO_SLEW_INFO  0x0000C0EC, 0x00000102
#define BF_SCL_SCLK_DRIVE_INFO 0x0000C0EC, 0x00000204
#define BF_SCL_SCLK_SLEW_INFO  0x0000C0EC, 0x00000106

#define REG_IRQ_CTRL1_ADDR      0x0000C100
#define BF_IRQ1_CLEAR_INFO      0x0000C100, 0x00000100
#define BF_IRQ2_CLEAR_INFO      0x0000C100, 0x00000101
#define BF_IRQ1_PINOUT_POL_INFO 0x0000C100, 0x00000104
#define BF_IRQ2_PINOUT_POL_INFO 0x0000C100, 0x00000105

#define REG_IRQ1_MASK1_ADDR         0x0000C101
#define BF_IRQ1_DAC0_CLIP_MASK_INFO 0x0000C101, 0x00000100
#define BF_IRQ1_ADC0_CLIP_MASK_INFO 0x0000C101, 0x00000104
#define BF_IRQ1_ADC1_CLIP_MASK_INFO 0x0000C101, 0x00000105
#define BF_IRQ1_ADC2_CLIP_MASK_INFO 0x0000C101, 0x00000106

#define REG_IRQ1_MASK2_ADDR              0x0000C102
#define BF_IRQ1_PLL_LOCKED_MASK_INFO     0x0000C102, 0x00000100
#define BF_IRQ1_PLL_UNLOCKED_MASK_INFO   0x0000C102, 0x00000101
#define BF_IRQ1_AVDD_UVW_MASK_INFO       0x0000C102, 0x00000102
#define BF_IRQ1_PRAMP_MASK_INFO          0x0000C102, 0x00000103
#define BF_IRQ1_ASRCI_LOCKED_MASK_INFO   0x0000C102, 0x00000104
#define BF_IRQ1_ASRCI_UNLOCKED_MASK_INFO 0x0000C102, 0x00000105
#define BF_IRQ1_ASRCO_LOCKED_MASK_INFO   0x0000C102, 0x00000106
#define BF_IRQ1_ASRCO_UNLOCKED_MASK_INFO 0x0000C102, 0x00000107

#define REG_IRQ1_MASK3_ADDR                 0x0000C103
#define BF_IRQ1_SPT0_UNLOCKED_MASK_INFO     0x0000C103, 0x00000100
#define BF_IRQ1_SYNC_LOCKED_MASK_INFO       0x0000C103, 0x00000101
#define BF_IRQ1_SYNC_UNLOCKED_MASK_INFO     0x0000C103, 0x00000102
#define BF_IRQ1_POWER_UP_COMPLETE_MASK_INFO 0x0000C103, 0x00000104
#define BF_IRQ1_EQ_CLEAR_DONE_MASK_INFO     0x0000C103, 0x00000105
#define BF_IRQ1_FDSP_MASK_ONZ_MASK_INFO     0x0000C103, 0x00000106

#define REG_IRQ2_MASK1_ADDR         0x0000C104
#define BF_IRQ2_DAC0_CLIP_MASK_INFO 0x0000C104, 0x00000100
#define BF_IRQ2_ADC0_CLIP_MASK_INFO 0x0000C104, 0x00000104
#define BF_IRQ2_ADC1_CLIP_MASK_INFO 0x0000C104, 0x00000105
#define BF_IRQ2_ADC2_CLIP_MASK_INFO 0x0000C104, 0x00000106

#define REG_IRQ2_MASK2_ADDR              0x0000C105
#define BF_IRQ2_PLL_LOCKED_MASK_INFO     0x0000C105, 0x00000100
#define BF_IRQ2_PLL_UNLOCKED_MASK_INFO   0x0000C105, 0x00000101
#define BF_IRQ2_AVDD_UVW_MASK_INFO       0x0000C105, 0x00000102
#define BF_IRQ2_PRAMP_MASK_INFO          0x0000C105, 0x00000103
#define BF_IRQ2_ASRCI_LOCKED_MASK_INFO   0x0000C105, 0x00000104
#define BF_IRQ2_ASRCI_UNLOCKED_MASK_INFO 0x0000C105, 0x00000105
#define BF_IRQ2_ASRCO_LOCKED_MASK_INFO   0x0000C105, 0x00000106
#define BF_IRQ2_ASRCO_UNLOCKED_MASK_INFO 0x0000C105, 0x00000107

